using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace AppMvc.Areas.Admin.Models
{
    public class MyExceptionAttribute2
    {

        /*
         缓存服务器
         日志记录服务器
         请求分发服务器
         数据库服务器
         web服务器多台
         其实也都是一个一个的站点
         或者是处理请求的一个一个站点
         分布式 
         集群
         日志并发的问题 写入一个队列
         所有的内容都是有对象来帮我封装好了可以来处理 
         知道如何来使用
         异常信息统一处理
         先将内容 记录内存 然后开启一个线程 单独的来记录错误 

         有几节视频 有些资料没有打不开 这个也是蛋疼的
         不是98% 100%的完整 还是要自己多花一点时间 去做去事件
         100%完美 一个阶段 还是了解一些东西的。

         MVC里面有一个 异常的过滤器 请求控制器当中 请求管道当中 
         与遇到错误的时候 都会有一个统一的错误 过程。
         这个时候就可以统一的处理一下问题的所在。。记录一下 
         异常  要注册一下 定义一个方法 子类重写父类的方法。。在控制器当中执行的其实就是子类的方法了
         有一些些的东西弄不明白 也不要台纠结 慢慢的都是会搞懂的
         搞好现在在做的事情就可以了。
         
         */
    }
}